[
	{
		"id": 1,
		"summary": "John Wick, a retired hitman, is grieving the recent death of his wife, Helen. She leaves him a final gift, a beagle puppy named Daisy, to help him cope with his loss. When a group of Russian gangsters led by Iosef Tarasov, the son of a powerful crime boss, steal John's car and kill his dog, John’s peaceful life is shattered. Seeking revenge, John dives back into the dangerous underworld he left behind. As he unleashes his lethal skills on Iosef’s men, he catches the attention of his former associates, including Viggo Tarasov, Iosef’s father, who will stop at nothing to take him down. John’s mission becomes a bloody battle for survival, as he proves that even a man seeking peace can be a deadly force when pushed too far.",
		"title": "John Wick (2014)"
	},
	{
		"id": 2,
		"summary": "After avenging his dog, John Wick hopes to retire again, but his past pulls him back in. He is forced by an old marker — a blood oath — to assist an Italian crime lord, Santino D’Antonio, in assassinating his sister Gianna, to take her place at the High Table, the governing council of the criminal underworld. When Santino betrays him, putting a bounty on John's head, Wick is forced to fight for his life once again. With every assassin in the world hunting him, John navigates a world of shifting alliances, facing brutal combat and impossible choices. The stakes rise as John uncovers the deeper, more treacherous workings of the High Table, leaving him no choice but to break the rules of the assassin’s code.",
		"title": "John Wick: Chapter 2 (2017)"
	},
	{
		"id": 3,
		"summary": "The story picks up immediately after Chapter 2, with John Wick excommunicated from the Continental Hotel for killing Santino D’Antonio on its grounds. A $14 million bounty is placed on his head, and John becomes a target for every assassin and mercenary in the world. With no allies left, John must navigate through a brutal and unforgiving landscape, seeking refuge with the mysterious Director, a figure from his past. Along the way, he faces off against a relentless army of enemies, including Zero, a deadly assassin, and ultimately confronts the High Table’s enforcer, the Adjudicator. As the war escalates, John seeks vengeance for the wrongs done to him, but at a great personal cost, setting the stage for an all-out battle for control of the underworld.",
		"title": "John Wick: Chapter 3 – Parabellum (2019)"
	},
	{
		"id": 4,
		"summary": "Following the events of Chapter 3, John Wick is still on the run, having survived multiple assassination attempts. He is seeking a way to defeat the High Table once and for all. With new alliances, including the mysterious and powerful 'Harbinger' and the support of old friends like Winston (Continental’s manager), John wages an epic war to challenge the High Table's authority. As the stakes grow, Wick faces his most formidable enemies yet, including a new adversary in the form of the Marquis de Gramont, who has ties to the High Table. As John moves toward a final showdown, he must confront his own inner demons and the brutal reality of his lifestyle. The battle culminates in a fierce and tragic conclusion, as John seeks both vengeance and redemption, with far-reaching consequences for the criminal world.",
		"title": "John Wick: Chapter 4 (2023)"
	}
]
